tap "a7ex/formulae"
tap "dracula/install"
tap "jesseduffield/lazygit"
tap "sst/tap"
tap "tw93/tap"
brew "openssl@3"
brew "node"
brew "basedpyright"
brew "libssh2"
brew "bat"
brew "chafa"
brew "cmake"
brew "cocoapods"
brew "php"
brew "composer"
brew "coreutils"
brew "ctags"
brew "fizz"
brew "wangle"
brew "fb303"
brew "edencommon"
brew "esbuild"
brew "expect"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "julia"
brew "lazygit"
brew "less"
brew "llvm"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "mdless"
brew "multimarkdown"
brew "tree-sitter"
brew "neovim"
brew "perl"
brew "pipx"
brew "pre-commit"
brew "prettier"
brew "prettierd"
brew "pstoedit"
brew "pygments"
brew "pyright"
brew "render"
brew "ripgrep"
brew "rust"
brew "sd"
brew "shellcheck"
brew "stylua"
brew "tailwindcss"
brew "tlrc"
brew "tmux"
brew "trash"
brew "tree"
brew "tree-sitter-cli"
brew "typescript"
brew "typescript-language-server"
brew "vim"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "xcbeautify"
brew "xdg-ninja", args: ["HEAD"]
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "a7ex/formulae/xcresultparser"
brew "sst/tap/opencode"
brew "tw93/tap/mole"
cask "1password-cli"
cask "alfred"
cask "betterdisplay"
cask "claude-code"
cask "db-browser-for-sqlite"
cask "dracula/install/dracula-insomnia"
cask "hammerspoon"
cask "iterm2"
cask "jordanbaird-ice"
cask "leader-key"
cask "lookaway"
cask "ngrok"
cask "pearcleaner"
cask "visual-studio-code"
vscode "adobe.extendscript-debug"
vscode "ahmadawais.shades-of-purple"
vscode "astral-sh.ty"
vscode "bmewburn.vscode-intelephense-client"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "ekelley.midnight-synth"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "njpwerner.autodocstring"
vscode "pdconsec.vscode-print"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "rendertom.adobe-script-runner"
vscode "rexshi.phpdoc-comment-vscode-plugin"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "samuelcolvin.jinjahtml"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "textualize.textual-syntax-highlighter"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "tyriar.sort-lines"
vscode "virgilsisoe.hammerspoon"
vscode "wallabyjs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "wholroyd.jinja"
vscode "wordpresstoolbox.wordpress-toolbox"
cargo "jinja-lsp"
cargo "stylua"
uv "flake8"
uv "frogmouth"
uv "ksc"
uv "pre-commit"
uv "pyright"
uv "ruff"
uv "ty"
